Repository: aprajnaparamita/shedidthat
Catalog: frontend/lib/l10n/app_*.arb
Languages: th, zh

# appTitle
source: She Absolutely Just Did That
th: เธอทำแบบนั้นจริงๆ
zh: 她绝对是故意的

# splashTitle
source: She Absolutely Just Did That
th: เธอทำแบบนั้นจริงๆ
zh: 她绝对是故意的

# splashBubbleText
source: Your situationship just did something unhinged and you need to debrief immediately. Jess is available. An AI best friend who's always awake, always invested, and has genuinely been waiting by the phone. Great questions. Zero judgment. Official ratings. She picked up on the first ring. Start talking.
th: คู่เดทของคุณเพิ่งทำอะไรบางอย่างที่น่าโมโห และคุณต้องการระบายทันที เจสพร้อมเสมอ เพื่อน AI ที่ดีที่สุดที่ตื่นอยู่เสมอ ทุ่มเทเสมอ และรอโทรศัพท์อยู่จริงๆ คำถามที่ดี ไม่มีการตัดสิน ให้คะแนนอย่างเป็นทางการ เธอรับสายตั้งแต่ครั้งแรก เริ่มคุยได้เลย
zh: 你的暧昧对象刚做了一件让你抓狂的事，你需要立刻吐槽。Jess随时待命。一个AI闺蜜，永远在线，永远投入，真心实意地在电话旁等着你。好问题。零评判。官方评级。她第一声就接了。开始聊吧。

# privacyTitle
source: ðŸ”’ Your Privacy Matters
th: 🔒 ความเป็นส่วนตัวของคุณสำคัญ
zh: 🔒 你的隐私很重要

# privacyText
source: All conversations are stored locally on your device only. No accounts. No cloud storage. No data collection. When you delete the app, everything goes with it.
th: การสนทนาทั้งหมดจะถูกเก็บไว้ในอุปกรณ์ของคุณเท่านั้น ไม่มีบัญชี ไม่มีการจัดเก็บข้อมูลบนคลาวด์ ไม่มีการรวบรวมข้อมูล เมื่อคุณลบแอป ทุกอย่างจะหายไปพร้อมกับมัน
zh: 所有对话只存储在你的设备本地。没有账户。没有云存储。没有数据收集。当你删除应用程序时，一切都会随之消失。

# githubButton
source: View on GitHub
th: ดูบน GitHub
zh: 在GitHub上查看

# createdByText
source: Created by Janet Jeffus, a solo lesbian developer. Learn more:
th: สร้างโดย Janet Jeffus, นักพัฒนาเลสเบี้ยนเดี่ยว เรียนรู้เพิ่มเติม:
zh: 由独立女同性恋开发者Janet Jeffus创建。 了解更多：

# getStartedButton
source: Get Started
th: เริ่มต้น
zh: 开始

# chatScreenTitle
source: Debrief
th: เล่าเรื่อง
zh: 汇报情况

# chatScreenHintText
source: Spill the tea...
th: เม้าท์มาเลย...
zh: 有什么瓜，说来听听...

# chatScreenWelcomeMessage
source: Hey bestie! So glad you're here. What's on your mind?
th: หวัดดีเพื่อนซี้! ดีใจจังที่เธออยู่นี่ มีอะไรในใจเหรอ?
zh: 嘿，闺蜜！很高兴你来了。在想什么呢？

# chatScreenErrorUnexpected
source: An unexpected error occurred. Please try again.
th: เกิดข้อผิดพลาดที่ไม่คาดคิด กรุณาลองใหม่อีกครั้ง
zh: 发生了意外错误。请再试一次。

# chatScreenErrorRetryInProgress
source: One moment, this is taking longer than normal
th: รอสักครู่นะคะ กำลังใช้เวลานานกว่าปกติ
zh: 请稍等，处理时间比平时长一些

# chatScreenErrorJessProblem
source: Jess is having a problem.
th: เจสกำลังมีปัญหา
zh: Jess现在有点问题。

# emptyStateTitle
source: No debriefs yet.
th: ยังไม่มีเรื่องเล่า
zh: 还没有任何汇报。

# emptyStateSubtitle
source: What are you waiting for?
th: รออะไรอยู่ล่ะ?
zh: 你还在等什么？

# emptyStateButton
source: Start Debriefing
th: เริ่มเล่าเรื่อง
zh: 开始汇报
